[M_HeavensDoor MissionDefinition]
MissionName="The gates of heaven have been opened"
MissionDescription="There is only one person between you and the piston. He is a young man who calls himself disabled. Unfortunately, as he puts it, his hideout is "impregnable."''.<br><br>It is recommended to have 3 access points nearby [place]karshana square[-place] So several of Barron's personal eagles took flight. You can then eliminate them, and if all goes well, Baron Kilmar will be so angry that he will invite you to his house and kill you.."
TurnInDescription="Now that the hotspot is open, you can kill the Falcon Llama Baron's army. If you destroy them and distract the boss, they will give you a chance to rob the house.."
MissionSummary="Open the door for another Lam Baron."
MissionGiver="Working class"
MissionTurnInLocation="false soldiers"
TeaserText=""

[M_HeavensDoor:AccessPoint1 MissionObjectiveDefinition]
ProgressMessage="Enter link 1"

[M_HeavensDoor:AccessPoint2 MissionObjectiveDefinition]
ProgressMessage="Add 2 access points"

[M_HeavensDoor:AccessPoint3 MissionObjectiveDefinition]
ProgressMessage="Connect to base station 3"

[M_HeavensDoor:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_HeavensDoor:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_HeavensDoor:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_HeavensDoor:MissionObjectiveSetDefinition_5 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_HeavensDoor:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_HeavensDoor:MissionObjectiveSetDefinition_7 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_HeavensDoor:ReachBattlePost MissionObjectiveDefinition]
ProgressMessage="Start an important meeting"

[M_HeavensDoor:ReachBattlePostEnd MissionObjectiveDefinition]
ProgressMessage="Go to the battlefield"

[M_HeavensDoor:Waypoint1 MissionObjectiveDefinition]
ProgressMessage="to visit the big world"

[M_HeavensDoor:Waypoint2 MissionObjectiveDefinition]
ProgressMessage="go to waste"

[M_IrisEp5_CageMatch MissionDefinition]
MissionName="thief"
MissionDescription="There's only one person standing between you and the Pistons: a young gladiator named Lame Baron. Mox will tell you it's online. [place]Market[-place]; Best to go out and finish it.."
TurnInDescription="You have come to Baron Lyme. Now we have to reveal his place of birth.."
MissionSummary="a tour [place]that's all[-place] And he destroyed the barons that were crippled."
MissionGiver="Moxie"
MissionTurnInLocation="Paying is an important factor."
TeaserText=""

[M_IrisEp5_CageMatch:CompleteInArena MissionObjectiveDefinition]
ProgressMessage="established in the area."

[M_IrisEp5_CageMatch:EnterForge MissionObjectiveDefinition]
ProgressMessage="Enter the field"

[M_IrisEp5_CageMatch:GetForgeKey MissionObjectiveDefinition]
ProgressMessage="He steals the key"

[M_IrisEp5_CageMatch:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp5_CageMatch:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride="Go to Torg's Forge and destroy the Crippled Baron.."
MissionDescriptionOverride="Only one person stands between him and Pistone: a man named Baron Lam. Moxie will say you are pregnant [place]Getting ready for the party[-place]; Now that you have the key, you can go in and take out the lame baron."

[M_IrisEp5_CageMatch:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride="Steal the scarf key.."
MissionDescriptionOverride="There is only one person between you and the Baker. A young wrestler who calls himself "The Wicked Baron". Moses tells him that he has roots. [place]fake kitchen[-place].<br><br>The problem is that someone is blocking the entrance to the castle, so the Torgue battle. He says he has to crack the safe and steal the key.."

[M_IrisEp5_CageMatch:MissionObjectiveSetDefinition_5 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp5_CageMatch:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp5_CageMatch:ReturnToArena MissionObjectiveDefinition]
ProgressMessage="Back and forth"

[M_IrisEp5_CageMatch:ReturnToHub MissionObjectiveDefinition]
ProgressMessage="Get out of the gym"

[M_IrisEp5_KickStartMyHeart MissionDefinition]
MissionName="Meaning: Set fire to my heart"
MissionDescription="There's only one person standing between you and the Pistons: a young fighter named Barra Baron..<br><br>You were so angry that he left you alone. Come teach me humility."
TurnInDescription="No more jokes. It's time to win the match.."
MissionSummary="Kill the baron."
MissionGiver="He's gone"
MissionTurnInLocation="Moxxi"
TeaserText=""

[M_IrisEp5_KickStartMyHeart:BreakIntoForge MissionObjectiveDefinition]
ProgressMessage="Go to Baron Lang's Tower."

[M_IrisEp5_KickStartMyHeart:DefeatBlimp MissionObjectiveDefinition]
ProgressMessage="Beat the piston plane."

[M_IrisEp5_KickStartMyHeart:DefeatFlyboy MissionObjectiveDefinition]
ProgressMessage="Destroy the lame baron."

[M_IrisEp5_KickStartMyHeart:FlyboyRoom MissionObjectiveDefinition]
ProgressMessage="visit the lame baron"

[M_IrisEp5_KickStartMyHeart:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp5_KickStartMyHeart:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp5_KickStartMyHeart:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp5_KickStartMyHeart:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp5_KickStartMyHeart:MissionObjectiveSetDefinition_7 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp5_KickStartMyHeart:MissionObjectiveSetDefinition_8 MissionObjectiveSetDefinition]
MissionSummaryOverride="Remove the piston ring."
MissionDescriptionOverride="There's only one person standing between you and the racket: a young warrior named Baron Lamb..<br> <br>Or until the piston breaks it into a thousand pieces..<br><br>Regardless of the law, finish the battle by attacking the crippled baron with the large piston rocket launcher..<br><br>Yes, that's what you took earlier. Stop reading this and start fighting!!"

[M_IrisEp5_KickStartMyHeart:ReachLift MissionObjectiveDefinition]
ProgressMessage="Use the elevator"

[M_IrisEp5_KickStartMyHeart:ReturnToMoxxi MissionObjectiveDefinition]
ProgressMessage="Back to Moxx."

